/*	$RCSfile: share_lib_conv_step.h $									*/
/*	$Date: 2015/10/23 18:24:14JST $										*/
/*	$Revision: 1.2 $													*/
/*	 EXPLANATION: 共通ライブラリ_ステップデータ変換 公開ヘッダファイル	*/

#ifndef SHARE_LIB_CONV_STEP_INC
#define SHARE_LIB_CONV_STEP_INC

#ifndef SHARE_LIB_CONV_STEP_DEF
#define SHARE_LIB_CONV_STEP_EXT extern
#else
#define SHARE_LIB_CONV_STEP_EXT
#endif

/*------------------------------------------------------------------------------*/
/*	インクルードファイル														*/
/*------------------------------------------------------------------------------*/
#include "share_lib.h"

/*------------------------------------------------------------------------------*/
/*	変数定義																	*/
/*------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------*/
/*	公開定義																	*/
/*------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------*/
/*	公開関数																	*/
/*------------------------------------------------------------------------------*/
SHARE_LIB_CONV_STEP_EXT uint8 ShareLibConvertStep(uint8 inVal,uint8 chgTblSize,const uint8 chgTbl[],uint8 *outVal);
																				/*	ステップデータ変換処理	*/

#endif	/* SHARE_LIB_CONV_STEP_INC */
